package hw3;

public class Task1 {
    public static void main(String[] args) {
        //Вывести все неотрицательные элементы последовательности 90 85 80 75 70 65 60 и тд
        for (int s1 = 90, e1 = 0; s1 >=e1; s1 = (s1-5)) {
            System.out.println(s1);
        }

        //Вывести на экран первые 10 элементов последовательности 2 4 6 8 10 и тд


    }
}
